tap "adoptopenjdk/openjdk"
tap "argoproj/tap"
tap "encoredev/tap"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "ngrok/ngrok"
tap "sanemat/font"
brew "act"
brew "anyenv"
brew "libpng"
brew "autoconf"
brew "aws-elasticbeanstalk"
brew "awscli"
brew "oniguruma"
brew "bat"
brew "bzip2"
brew "pcre2"
brew "glib"
brew "carapace"
brew "emacs"
brew "cask"
brew "cliclick"
brew "ripgrep"
brew "codex"
brew "krb5"
brew "libzip"
brew "tidy-html5"
brew "composer"
brew "direnv"
brew "eksctl"
brew "fd"
brew "fzf"
brew "gcc"
brew "gh"
brew "harfbuzz"
brew "netpbm"
brew "pango"
brew "librsvg"
brew "graphviz"
brew "helm"
brew "jpeg"
brew "jq"
brew "ktlint"
brew "kubernetes-cli"
brew "libedit"
brew "libiconv"
brew "libxml2"
brew "libxslt"
brew "mas"
brew "mkcert"
brew "nghttp2"
brew "node"
brew "openjdk@17"
brew "pastel"
brew "peco"
brew "pinentry-mac"
brew "pkgconf"
brew "pnpm"
brew "python@3.10"
brew "re2c"
brew "shellcheck"
brew "shfmt"
brew "tig"
brew "tmux"
brew "tree"
brew "uv"
brew "vim"
brew "wget"
brew "xdg-ninja"
brew "yarn"
brew "zoxide"
brew "zsh"
brew "zsh-completions"
brew "argoproj/tap/kubectl-argo-rollouts"
brew "encoredev/tap/encore"
cask "alfred"
cask "anki"
cask "chatgpt"
cask "chatgpt-atlas"
cask "claude"
cask "clipy"
cask "corretto@21"
cask "cursor"
cask "dbeaver-community"
cask "deepl"
cask "devtoys"
cask "discord"
cask "displaylink"
cask "docker-desktop"
cask "evernote"
cask "firefox"
cask "flux-app"
cask "font-hackgen"
cask "font-hackgen-nerd"
cask "font-meslo-for-powerline"
cask "font-source-han-code-jp"
cask "gather"
cask "google-chrome"
cask "google-japanese-ime"
cask "gyazo"
cask "hiddenbar"
cask "intellij-idea"
cask "kindle"
cask "kiro"
cask "logi-options+"
cask "microsoft-edge"
cask "ngrok"
cask "obsidian"
cask "phpstorm"
cask "postman"
cask "raycast"
cask "shureplus-motiv"
cask "slack"
cask "spotify"
cask "steam"
cask "tableplus"
cask "tunnelblick"
cask "wezterm"
cask "wireshark-app"
cask "wireshark-app"
cask "zap"
cask "zoom"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "JustFocus", id: 1142151959
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
vscode "aaron-bond.better-comments"
vscode "amadeann.jack-language-syntax-highlighting"
vscode "anthropic.claude-code"
vscode "asciidoctor.asciidoctor-vscode"
vscode "christian-kohler.path-intellisense"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "devsense.composer-php-vscode"
vscode "devsense.intelli-php-vscode"
vscode "devsense.phptools-vscode"
vscode "devsense.profiler-php-vscode"
vscode "dotjoshjohnson.xml"
vscode "dsznajder.es7-react-js-snippets"
vscode "dtsvet.vscode-wasm"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "emeraldwalk.runonsave"
vscode "esbenp.prettier-vscode"
vscode "felixfbecker.php-intellisense"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "fwcd.kotlin"
vscode "gamunu.vscode-yarn"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "golang.go"
vscode "gurumukhi.selected-lines-count"
vscode "ibm.output-colorizer"
vscode "jakebathman.mysql-syntax"
vscode "janisdd.vscode-edit-csv"
vscode "mhutchie.git-graph"
vscode "mohsen1.prettify-json"
vscode "mosapride.zenkaku"
vscode "mrmlnc.vscode-duplicate"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "octref.vetur"
vscode "oderwat.indent-rainbow"
vscode "openai.chatgpt"
vscode "orta.vscode-jest"
vscode "pkief.material-icon-theme"
vscode "quicktype.quicktype"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-microprofile"
vscode "redhat.vscode-quarkus"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "ryanolsonx.solarized"
vscode "streetsidesoftware.code-spell-checker"
vscode "svelte.svelte-vscode"
vscode "tomoki1207.vscode-input-sequence"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-concourse"
vscode "vmware.vscode-manifest-yaml"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-lombok"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "vue.volar"
vscode "wmaurer.change-case"
vscode "xdebug.php-debug"
